; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 - counter
	)
  (:init
		(= (value c0) 99)
	(= (value c1) 83)
	(= (value c2) 86)
	(= (value c3) 90)
	(= (value c4) 8)
	(= (value c5) 81)
	(= (value c6) 8)
	(= (value c7) 26)
	(= (value c8) 32)
	(= (value c9) 68)
	(= (value c10) 74)
	(= (value c11) 4)
	(= (value c12) 27)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 8 of 12
2. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 8 of 12
3. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 8 of 12
4. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 8 of 12
5. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 8 of 12
6. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 8 of 12
7. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 8 of 12
8. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 12
9. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 8 of 12
10. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 8 of 12
11. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 8 of 12
12. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 8 of 12
13. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 8 of 12
14. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 8 of 12
15. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 12
16. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 12
17. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 8 of 12
18. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 8 of 12
19. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 8 of 12
20. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 8 of 12
21. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 8 of 12
22. (increment c6)
   changed: (value c6) from 8 to 16
   goals met: 8 of 12
23. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 8 of 12
24. (increment c6)
   changed: (value c6) from 16 to 25
   goals met: 8 of 12
25. (increment c6)
   changed: (value c6) from 25 to 34
   goals met: 7 of 12
26. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 7 of 12
27. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 12
28. (increment c6)
   changed: (value c6) from 34 to 44
   goals met: 7 of 12
29. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 12
30. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 7 of 12
31. (increment c4)
   changed: (value c4) from 8 to 17
   goals met: 7 of 12
32. (increment c4)
   changed: (value c4) from 17 to 26
   goals met: 7 of 12
33. (increment c4)
   changed: (value c4) from 26 to 35
   goals met: 7 of 12
34. (increment c4)
   changed: (value c4) from 35 to 44
   goals met: 7 of 12
35. (increment c4)
   changed: (value c4) from 44 to 53
   goals met: 7 of 12
36. (increment c4)
   changed: (value c4) from 53 to 62
   goals met: 7 of 12
37. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 7 of 12
38. (increment c4)
   changed: (value c4) from 62 to 72
   goals met: 7 of 12
39. (increment c4)
   changed: (value c4) from 72 to 82
   goals met: 6 of 12
40. (increment c5)
   changed: (value c5) from 81 to 83
   goals met: 7 of 12
41. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 7 of 12
42. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 12
43. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 7 of 12
44. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 7 of 12
45. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 7 of 12
46. (increment c1)
   changed: (value c1) from 83 to 88
   goals met: 6 of 12
47. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 6 of 12
48. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 6 of 12
49. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 6 of 12
50. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 6 of 12
51. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 6 of 12
52. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 6 of 12
53. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 6 of 12
54. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 6 of 12
55. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 6 of 12
56. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 6 of 12
57. (increment c11)
   changed: (value c11) from 4 to 14
   goals met: 6 of 12
58. (increment c11)
   changed: (value c11) from 14 to 24
   goals met: 6 of 12
59. (increment c11)
   changed: (value c11) from 24 to 34
   goals met: 5 of 12
60. (increment c11)
   changed: (value c11) from 34 to 44
   goals met: 5 of 12
61. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 5 of 12
62. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 5 of 12
63. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 5 of 12
64. (decrement c11)
   changed: (value c11) from 44 to 34
   goals met: 5 of 12
65. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 5 of 12
66. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 5 of 12
67. (decrement c10)
   changed: (value c10) from 74 to 69
   goals met: 5 of 12
68. (decrement c10)
   changed: (value c10) from 69 to 64
   goals met: 4 of 12
69. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 4 of 12
70. (increment c10)
   changed: (value c10) from 64 to 70
   goals met: 5 of 12
71. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 5 of 12
72. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 5 of 12
73. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 5 of 12
74. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 5 of 12
75. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 5 of 12
76. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 5 of 12
77. (decrement c6)
   changed: (value c6) from 44 to 34
   goals met: 5 of 12
78. (decrement c5)
   changed: (value c5) from 83 to 79
   goals met: 4 of 12
79. (increment c4)
   changed: (value c4) from 82 to 92
   goals met: 5 of 12
80. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 5 of 12
81. (decrement c5)
   changed: (value c5) from 79 to 74
   goals met: 5 of 12
82. (decrement c5)
   changed: (value c5) from 74 to 69
   goals met: 5 of 12
83. (decrement c5)
   changed: (value c5) from 69 to 64
   goals met: 5 of 12
84. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 5 of 12
85. (decrement c6)
   changed: (value c6) from 34 to 24
   goals met: 6 of 12
86. (decrement c5)
   changed: (value c5) from 64 to 58
   goals met: 6 of 12
87. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 6 of 12
88. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 6 of 12
89. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 6 of 12
90. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 6 of 12
91. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 6 of 12
92. (increment c1)
   changed: (value c1) from 88 to 94
   goals met: 6 of 12
93. (increment c1)
   changed: (value c1) from 94 to 100
   goals met: 7 of 12
94. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 7 of 12
95. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 7 of 12
96. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 7 of 12
97. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 7 of 12
98. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 7 of 12
99. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 7 of 12
100. (increment c2)
   changed: (value c2) from 86 to 89
   goals met: 7 of 12
101. (increment c11)
   changed: (value c11) from 34 to 44
   goals met: 7 of 12
102. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 12
103. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 12
104. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 12
105. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 7 of 12
106. (increment c12)
   changed: (value c12) from 27 to 31
   goals met: 7 of 12
107. (increment c12)
   changed: (value c12) from 31 to 35
   goals met: 7 of 12
108. (increment c12)
   changed: (value c12) from 35 to 39
   goals met: 7 of 12
109. (increment c12)
   changed: (value c12) from 39 to 43
   goals met: 7 of 12
110. (increment c12)
   changed: (value c12) from 43 to 47
   goals met: 8 of 12
111. (decrement c10)
   changed: (value c10) from 70 to 60
   goals met: 7 of 12
112. (increment c11)
   changed: (value c11) from 44 to 54
   goals met: 6 of 12
113. (increment c12)
   changed: (value c12) from 47 to 51
   goals met: 6 of 12
114. (increment c12)
   changed: (value c12) from 51 to 55
   goals met: 7 of 12
115. (increment c10)
   changed: (value c10) from 60 to 70
   goals met: 8 of 12
116. (increment c11)
   changed: (value c11) from 54 to 64
   goals met: 7 of 12
117. (increment c12)
   changed: (value c12) from 55 to 59
   goals met: 7 of 12
118. (increment c12)
   changed: (value c12) from 59 to 63
   goals met: 7 of 12
119. (increment c12)
   changed: (value c12) from 63 to 67
   goals met: 8 of 12
120. (increment c11)
   changed: (value c11) from 64 to 74
   goals met: 8 of 12
121. (increment c12)
   changed: (value c12) from 67 to 71
   goals met: 8 of 12
122. (increment c12)
   changed: (value c12) from 71 to 75
   goals met: 9 of 12
123. (increment c6)
   changed: (value c6) from 24 to 34
   goals met: 8 of 12
124. (decrement c5)
   changed: (value c5) from 58 to 48
   goals met: 8 of 12
125. (decrement c5)
   changed: (value c5) from 48 to 38
   goals met: 8 of 12
126. (decrement c5)
   changed: (value c5) from 38 to 28
   goals met: 9 of 12
127. (decrement_rate c5)
   changed: (rate_value c5) from 10 to 9
   goals met: 9 of 12
128. (increment c5)
   changed: (value c5) from 28 to 37
   goals met: 8 of 12
129. (increment c5)
   changed: (value c5) from 37 to 46
   goals met: 8 of 12
130. (increment c5)
   changed: (value c5) from 46 to 55
   goals met: 8 of 12
131. (increment c5)
   changed: (value c5) from 55 to 64
   goals met: 8 of 12
132. (increment c5)
   changed: (value c5) from 64 to 73
   goals met: 8 of 12
133. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 8 of 12
134. (decrement c1)
   changed: (value c1) from 100 to 91
   goals met: 7 of 12
135. (decrement c1)
   changed: (value c1) from 91 to 82
   goals met: 8 of 12
136. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 8 of 12
137. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 8 of 12
138. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 8 of 12
139. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 8 of 12
140. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 8 of 12
141. (increase_rate c0)
   changed: (rate_value c0) from 5 to 6
   goals met: 8 of 12
142. (decrement c0)
   changed: (value c0) from 99 to 93
   goals met: 8 of 12
143. (decrement c0)
   changed: (value c0) from 93 to 87
   goals met: 8 of 12
144. (decrement c0)
   changed: (value c0) from 87 to 81
   goals met: 9 of 12
145. (decrement c6)
   changed: (value c6) from 34 to 24
   goals met: 10 of 12
146. (decrement c5)
   changed: (value c5) from 73 to 63
   goals met: 10 of 12
147. (decrement c4)
   changed: (value c4) from 92 to 82
   goals met: 9 of 12
148. (decrement c3)
   changed: (value c3) from 90 to 85
   goals met: 8 of 12
149. (decrement c3)
   changed: (value c3) from 85 to 80
   goals met: 9 of 12
150. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 9 of 12
151. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 9 of 12
152. (decrement c2)
   changed: (value c2) from 89 to 84
   goals met: 9 of 12
153. (decrement c2)
   changed: (value c2) from 84 to 79
   goals met: 9 of 12
154. (decrement c1)
   changed: (value c1) from 82 to 73
   goals met: 9 of 12
155. (decrement c0)
   changed: (value c0) from 81 to 75
   goals met: 9 of 12
156. (decrement c0)
   changed: (value c0) from 75 to 69
   goals met: 10 of 12
157. (increment c6)
   changed: (value c6) from 24 to 34
   goals met: 9 of 12
158. (increment c5)
   changed: (value c5) from 63 to 73
   goals met: 9 of 12
159. (decrement c4)
   changed: (value c4) from 82 to 72
   goals met: 9 of 12
160. (decrement c3)
   changed: (value c3) from 80 to 75
   goals met: 8 of 12
161. (decrement c3)
   changed: (value c3) from 75 to 70
   goals met: 9 of 12
162. (decrement c2)
   changed: (value c2) from 79 to 74
   goals met: 9 of 12
163. (decrement c2)
   changed: (value c2) from 74 to 69
   goals met: 9 of 12
164. (decrement c1)
   changed: (value c1) from 73 to 64
   goals met: 9 of 12
165. (decrement c0)
   changed: (value c0) from 69 to 63
   goals met: 10 of 12
166. (decrement c6)
   changed: (value c6) from 34 to 24
   goals met: 11 of 12
167. (decrement c5)
   changed: (value c5) from 73 to 63
   goals met: 10 of 12
168. (decrement c4)
   changed: (value c4) from 72 to 62
   goals met: 10 of 12
169. (decrement c3)
   changed: (value c3) from 70 to 65
   goals met: 9 of 12
170. (decrement c3)
   changed: (value c3) from 65 to 60
   goals met: 10 of 12
171. (decrement c2)
   changed: (value c2) from 69 to 64
   goals met: 9 of 12
172. (decrement c2)
   changed: (value c2) from 64 to 59
   goals met: 10 of 12
173. (decrement c1)
   changed: (value c1) from 64 to 55
   goals met: 10 of 12
174. (decrement c0)
   changed: (value c0) from 63 to 57
   goals met: 10 of 12
175. (decrement c0)
   changed: (value c0) from 57 to 51
   goals met: 11 of 12
176. (increment c6)
   changed: (value c6) from 24 to 34
   goals met: 10 of 12
177. (decrement c5)
   changed: (value c5) from 63 to 53
   goals met: 9 of 12
178. (decrement c4)
   changed: (value c4) from 62 to 52
   goals met: 9 of 12
179. (decrement c3)
   changed: (value c3) from 60 to 55
   goals met: 8 of 12
180. (decrement c3)
   changed: (value c3) from 55 to 50
   goals met: 9 of 12
181. (decrement c2)
   changed: (value c2) from 59 to 54
   goals met: 8 of 12
182. (decrement c2)
   changed: (value c2) from 54 to 49
   goals met: 9 of 12
183. (decrement c1)
   changed: (value c1) from 55 to 46
   goals met: 9 of 12
184. (decrement c0)
   changed: (value c0) from 51 to 45
   goals met: 10 of 12
185. (decrement c6)
   changed: (value c6) from 34 to 24
   goals met: 11 of 12
186. (decrement c5)
   changed: (value c5) from 53 to 43
   goals met: 10 of 12
187. (decrement c4)
   changed: (value c4) from 52 to 42
   goals met: 10 of 12
188. (decrement c3)
   changed: (value c3) from 50 to 45
   goals met: 9 of 12
189. (decrement c3)
   changed: (value c3) from 45 to 40
   goals met: 10 of 12
190. (decrement c2)
   changed: (value c2) from 49 to 44
   goals met: 9 of 12
191. (decrement c2)
   changed: (value c2) from 44 to 39
   goals met: 10 of 12
192. (decrement c1)
   changed: (value c1) from 46 to 37
   goals met: 10 of 12
193. (decrement c0)
   changed: (value c0) from 45 to 39
   goals met: 10 of 12
194. (decrement c0)
   changed: (value c0) from 39 to 33
   goals met: 11 of 12
195. (increment c6)
   changed: (value c6) from 24 to 34
   goals met: 10 of 12
196. (decrement c5)
   changed: (value c5) from 43 to 33
   goals met: 10 of 12
197. (decrement c4)
   changed: (value c4) from 42 to 32
   goals met: 10 of 12
198. (decrement c3)
   changed: (value c3) from 40 to 35
   goals met: 9 of 12
199. (decrement c3)
   changed: (value c3) from 35 to 30
   goals met: 10 of 12
200. (decrement c2)
   changed: (value c2) from 39 to 34
   goals met: 9 of 12
201. (decrement c2)
   changed: (value c2) from 34 to 29
   goals met: 10 of 12
202. (decrement c1)
   changed: (value c1) from 37 to 28
   goals met: 10 of 12
203. (decrement c0)
   changed: (value c0) from 33 to 27
   goals met: 11 of 12
204. (decrement c6)
   changed: (value c6) from 34 to 24
   goals met: 11 of 12
205. (decrement c5)
   changed: (value c5) from 33 to 23
   goals met: 11 of 12
206. (decrement c4)
   changed: (value c4) from 32 to 22
   goals met: 11 of 12
207. (decrement c3)
   changed: (value c3) from 30 to 25
   goals met: 10 of 12
208. (decrement c3)
   changed: (value c3) from 25 to 20
   goals met: 11 of 12
209. (decrement c2)
   changed: (value c2) from 29 to 24
   goals met: 10 of 12
210. (decrement c2)
   changed: (value c2) from 24 to 19
   goals met: 11 of 12
211. (decrement c1)
   changed: (value c1) from 28 to 19
   goals met: 10 of 12
212. (decrement c1)
   changed: (value c1) from 19 to 10
   goals met: 11 of 12
213. (decrement c0)
   changed: (value c0) from 27 to 21
   goals met: 11 of 12
214. (decrement c0)
   changed: (value c0) from 21 to 15
   goals met: 11 of 12
215. (decrement c0)
   changed: (value c0) from 15 to 9
   goals met: 12 of 12
